blog/generate-ssh-key-to-connect-host.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>如何生成密钥连接Linux实例</title>
<!-- 2018-07-03 Tue 14:45 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Siqing Mu" />
<link rel="shortcut icon" href="https://www.khow.me/blog/images/favicon.ico" /><link rel="stylesheet" type="text/css" href="./css/site.css" />
</head>
<body>
<div id="content">
<h1 class="title">如何生成密钥连接Linux实例</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Creating a new SSH key</a></li>
<li><a href="#sec-2">2. Locating an SSH key</a></li>
<li><a href="#sec-3">3. Connect to instance</a></li>
</ul>
</div>
</div>
<p>
SRC:<a href="https://cloud.google.com/compute/docs/instances/adding-removing-ssh-keys">https://cloud.google.com/compute/docs/instances/adding-removing-ssh-keys</a>
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Creating a new SSH key</h2>
<div class="outline-text-2" id="text-1">
<p>
If you do not have an existing private SSH key file and a matching public SSH key file that you can use, generate a new SSH key. If you want to use an existing SSH key, locate the public SSH key file.
</p>

<ol class="org-ol">
<li>Open a terminal on your workstation and use the ssh-keygen command to generate a new key. Specify the -C flag to add a comment with your username.
</li>
</ol>
<pre class="example">
ssh-keygen -t rsa -f ~/.ssh/[KEY_FILENAME] -C [USERNAME]
</pre>


<ol class="org-ol">
<li>Restrict access to your private key so that only you can read it and nobody can write to it.
</li>
</ol>
<pre class="example">
chmod 400 ~/.ssh/[KEY_FILENAME]
</pre>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Locating an SSH key</h2>
<div class="outline-text-2" id="text-2">
<p>
If you created a key on a Linux or macOS workstation by using the ssh-keygen tool, your key was saved to the following locations:
</p>
<pre class="example">
+ Public key file: ~/.ssh/[KEY_FILENAME].pub
+ Private key file: ~/.ssh/[KEY_FILENAME]
</pre>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Connect to instance</h2>
<div class="outline-text-2" id="text-3">
<pre class="example">
ssh -i ~/.ssh/[KEY_FILENAME] [HOSTNAME/HOSTIP]
</pre>
</div>
</div>
</div>
<div id="postamble" class="status">
<div id="disqus_thread"></div>
            <script type="text/javascript">
            var disqus_shortname = 'seymer';
            (function() {
                    var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
                    dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
                    (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
                    })();
            </script>
            <script>
              (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
                      (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
                      m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
                      })(window,document,'script','//www.google-analytics.com/analytics.js','ga');

              ga('create', 'UA-110114842-1', 'auto');
              ga('send', 'pageview');
            </script>
</div>
</body>
</html>
